# Задание 1

pet_type = input("Введите вид питомца: ")
pet_age = input("Введите возраст питомца: ")
pet_name = input("Введите кличку питомца: ")

print(f'Это {pet_type} по кличке "{pet_name}". Возраст: {pet_age} года.')


# Задание 2

stage1 = input("Введите первую стадию развития человека: ")
stage2 = input("Введите вторую стадию развития человека: ")
stage3 = input("Введите третью стадию развития человека: ")
stage4 = input("Введите четвертую стадию развития человека: ")
stage5 = input("Введите пятую стадию развития человека: ")
stage6 = input("Введите шестую стадию развития человека: ")


print(stage1, stage2, stage3, stage4, stage5, stage6, sep=' => ')